Revit 2026 API

# Edge Class

---

An edge of a 3d solid.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBEdge

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Edge : GeometryObject
```
```vb
Public Class Edge
	Inherits GeometryObject
```
```cpp
public ref class Edge : public GeometryObject
```
```fsharp
type Edge =
    class
        inherit GeometryObject
    end
```

The Edge type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ApproximateLength | Returns the approximate length of the edge. |
|  | GraphicsStyleId | The ElementId of the GeometryObject's GraphicsStyle(Inherited from GeometryObject) |
|  | Id | A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement.(Inherited from GeometryObject) |
|  | IsElementGeometry | Indicates whether this geometry is obtained directly from an Element.(Inherited from GeometryObject) |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | Reference | Returns a stable reference to the edge. |
|  | Visibility | The visibility.(Inherited from GeometryObject) |

|  | Name | Description |
| --- | --- | --- |
|  | AsCurve | Returns a curve that corresponds to the edge's parametric orientation. |
|  | AsCurveFollowingFace | Returns a curve that corresponds to this edge as oriented in its topological direction on the specified face. |
|  | ComputeDerivatives | Returns the vectors describing the edge at the specified parameter. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Inherited from GeometryObject) |
|  | Evaluate | Evaluates a parameter on the edge. |
|  | EvaluateOnFace | Evaluates a parameter on the edge to produce UV coordinates on the face. |
|  | GetCurveUV(Int32) | Calculate a 2D curve that represents the edge in the uv-parameter plane of one of the edge's faces. The output curve's direction will follow the parametric direction of the edge, not the topological direction of the edge on the given face. |
|  | GetCurveUV(Int32, Transform2D) | Calculate and transform a 2D curve that represents the edge in the uv-parameter plane of one of the edge's faces. The output curve's direction will follow the parametric direction of the edge, not the topological direction of the edge on the given face. |
|  | GetEndPointReference | Returns a stable reference to the start or the end point of the edge. |
|  | GetFace | Returns one of the two faces that meet at the edge. |
|  | GetHashCode | Gets the integer value of the geometry object as hash code (Inherited from GeometryObject) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsFlippedOnFace(Face) | Determines if this edge's topological direction on the Face is opposite to its parametric direction. |
|  | IsFlippedOnFace(Int32) | Determines if this edge's topological direction on the Face is opposite to its parametric direction. |
|  | Tessellate | Returns a polyline approximation to the edge. |
|  | TessellateOnFace | Returns a polyline approximation to the edge in UV parameters of the face. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Edges are defined by intersections of surfaces that form faces of the solid. They have arbitrary parameterization that is normalized to [0,1].

#### Reference

Autodesk.Revit.DB Namespace